//js/data.js

const teamsData = {
  "Капітан Америка": {
    names: ["Владислав", "Назар", "Тимофій", "Володимир", "Ярослав", "Єгор", "Око Сокола"],
    isMaleTeam: true,
    leaderName: "Андрій",
  },
  Месники: {
    names: ["Мілка", "Настя", "Юля", "Марія", "Маргарити", "Радомира", "Віжен"],
    isMaleTeam: false,
    leaderName: "Жанна",
  },
  "Вартові Галактики": {
    names: ["Аня", "Софія В", "Софія П", "Юля", "Богдана", "Дана", "Даша", , "Кіра", "Небула"],
    isMaleTeam: false,
    leaderName: "Яна",
  },
  "Чорні пантери": {
    names: ["Емма", "Шурі", "Аня", "Злата", "Марта", "Соломія", "Евеліна", "Марійка", "Діана"],
    isMaleTeam: false,
    leaderName: "Яна",
  },
  Тор: {
    names: ["Аня", "Оля", "Хеймдалль", "Дарина", "Маша", "Настя", "Поліна", "Софія", "Настя"],
    isMaleTeam: false,
    leaderName: "Ніка",
  },
  "Speider-man": {
    names: ["Аня", "Ніка", "Лілія", "Настя", "Оля", "Лера", "Софія", "Мері Джейн"],
    isMaleTeam: false,
    leaderName: "Одарка",
  },
  Марвел: {
    names: ["Іван", "Нік Ф'юрі", "Марк", "Діма", "Тимофій Б", "Тимофій О", "Матвій"],
    isMaleTeam: true,
    leaderName: "Рома",
  },
  Халк: {
    names: ["Брюс Беннер", "Матвій М", "Матфій О", "Влад", "Назар", "Матвій С", "Андрій"],
    isMaleTeam: true,
    leaderName: "Петя",
  },
};
